{
  "id": 3,
  "title": "American Physical Society (APS)",
  "description": "Served as technical lead on a high-visibility web platform rebuild for the American Physical Society, guiding the project from discovery through to successful launch. Delivered the product on time and within budget, despite challenges including a shifting tech stack, integration of unfamiliar client-preferred technologies, and evolving stakeholder expectations.  Crafted clean, maintainable, and well-documented code while mentoring the development team, troubleshooting blockers, and facilitating architectural decisions. Balanced client needs with technical feasibility, while maintaining calm and collaborative client relationships. Recognized for thoughtful problem-solving, clear communication of tradeoffs, and consultative leadership throughout. Served as co-technical lead on a high-visibility web platform rebuild for the American Physical Society, guiding the project from discovery through to successful launch. Delivered the product on time and within budget, despite challenges including a shifting tech stack, integration of unfamiliar client-preferred technologies, and evolving stakeholder expectations. Crafted clean, maintainable, and well-documented code while mentoring the development team, troubleshooting blockers, and facilitating architectural decisions. Balanced client needs with technical feasibility, while maintaining calm and collaborative client relationships. Recognized for thoughtful problem-solving, clear communication of tradeoffs, and consultative leadership throughout.",
  "summary": "As technical lead for a major rebuild of the American Physical Society’s web platform, I guided the project from discovery to successful launch—on time and within budget—despite shifting technologies and evolving stakeholder needs. I provided steady architectural leadership, mentored the team, and was recognized for clear communication, consultative problem-solving, and delivering clean, maintainable code under pressure.",
  "image": "/uploads/75be6259-a14c-4d0e-9cba-4ae07df185e8.png",
  "link": "https://www.aps.org/",
  "role": "Lead Architect",
  "skills": [],
  "createdAt": "2025-05-01T17:38:13.483Z"
}